Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--mapbender_overview.tmx
Source language: en
Languages: ja

source: Geoportal Framework
ja: Geoportalフレームワーク

source: `Mapbender <https://mapbender.org/en>`_ is a graduated OSGeo project. It is a web based geoportal framework to publish, register, view, navigate, monitor and grant secure access to spatial data infrastructure services.
ja: `Mapbender<https://mapbender.org/en>`_は卒業したOSGeoプロジェクトです。これは、空間データインフラストラクチャサービスへの安全なアクセスを公開、登録、ビュー、ナビゲート、監視、および付与するためのWebベースのGeoportal フレームワークです。

source: Mapbender is the tip of the iceberg, a meta layer of software providing access to SDI components adhering to international standards. Mapbender allows users to easily create customised browser clients from a wide range of widgets (without any/with minimal) programming required. Widgets integrate with server functionality to provide advanced functionality like security proxying, digitizing, auto snapping and more.
ja: Mapbenderは、いわば氷山の一角であり、国際標準に準拠したSDIコンポーネントへのアクセスを提供するソフトウェアのメタレイヤです。Mapbenderを使用すると、ユーザーはさまざまなウィジェットから、プログラミング不要、あるいは最小限のプログラミングで、カスタマイズされたブラウザクライアントを簡単に作成できます。ウィジェットはサーバ機能と統合され、セキュリティプロキシ、デジタイズ、自動スナップなどの先進的な機能を提供します。

source: Mapbender management applications are straight forward and easy to use providing highly focused functionality for the operation of large scale distributed SDI components. It is the tool of choice for SDI administrators who need to maintain, categorize and monitor map and feature services. Mapbender grants access to individuals, groups and manages machine to machine access. Adherence to standardized services, such as OGC WMS allows to take advantage of interoperable services from a multitude of server platforms.
ja: Mapbender管理アプリケーションは、大規模な分散SDIコンポーネントの操作に高度に焦点を当てた機能を提供する、簡単で使いやすいものです。これは、マップと地物のサービスを維持、分類、および監視する必要があるSDI管理者向けのツールです。Mapbenderは、個人、グループへのアクセスを許可し、M2Mアクセスを管理します。OGC WMSなどの標準化されたサービスに準拠することで、多数のサーバプラットフォームから相互運用可能なサービスを利用できます。

source: Mapbender is based on Symfony, OpenLayers and jQuery.
ja: MapbenderはSymfony、OpenLayers、およびjQueryに基づいています。

source: Core Features
ja: 主要機能

source: Easily create web mapping interfaces using template applications
ja: テンプレートアプリケーションを使用してWebマッピングインターフェイスを簡単に作成する

source: add/remove/customize applications
ja: アプリケーションの追加/削除/カスタマイズ

source: Create applications with digitize functionality
ja: デジタイズ機能を備えたアプリケーションを作成する

source: Create mobile Applications
ja: モバイルアプリケーションを作成する

source: Print high-quality maps using your own PDF templates.
ja: 独自のPDFテンプレートを使用して高品質な地図を印刷します。

source: Digitizing via SQL
ja: SQLによるデジタイズ

source: Upload and share remote OGC WMS (Capabilities caching)
ja: アップロードしてリモートOGC WMS(キャッシュ機能つき)を共有する

source: arrange uploaded WMS for overlay
ja: アップロードされたWMSをオーバーレイ用に加工する

source: editing layer visibility
ja: レイヤの可視性を編集する

source: order
ja: 順序

source: Create users and groups, share and grant access to services and modules
ja: ユーザーとグループを作成し、サービスとモジュールへのアクセスを共有および許可する

source: Restrict user access with the OWS security proxy module via trusted servers
ja: 信頼されたサーバー経由でOWSセキュリティプロキシモジュールを使用してユーザーアクセスを制限する

source: Encrypted protocols monitoring and status notification and auto-update service for remote OGC services
ja: リモートOGCサービスのための暗号化プロトコルモニタリング、ステータス通知、自動更新サービス

source: ... and more!
ja: などなど ...

source: Implemented Standards
ja: 実装されている標準規格

source: Details
ja: 詳細

source: **Website:** https://mapbender.org
ja: **Webサイト:** https://mapbender.org

source: **Licence:** `MIT license <https://opensource.org/licenses/MIT>`_
ja: **ライセンス:** `MIT license <https://opensource.org/licenses/MIT>`_

source: **Software Version:** |version-mapbender|
ja: **ソフトウェアバージョン:** |version-mapbender|

source: **Supported Platforms:** Windows, Linux, Mac
ja: **対応プラットフォーム:** Windows, Linux, Mac

source: **Support:** https://mapbender.org/en/community
ja: **サポート:** https://mapbender.org/en/community

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/mapbender_quickstart>`
ja: :doc:`クイックスタート文書 <../quickstart/mapbender_quickstart>`
